ips.org
#+title: Introduction to Probability and Statistics
#+DESCRIPTION: Probability and Statistics Notes
#+SETUPFILE: ./org-html-themes/org/theme-readtheorg.setup
#+AUTHOR: Akash Gopinath
#+OPTIONS: num:nil ^:{}

* Pre Requisites
The only requirement is a course on Calculus, Set Theory and Logic.

* Reference Textbook
The textbook referenced in this course was [[https://www.amazon.co.uk/Modern-Introduction-Probability-Statistics-Understanding/dp/1852338962/ref=sr_1_1?crid=3CCIB6UU05SM7&keywords=A+Modern+Introduction+to+Probability+and+Statistics+Understanding+Why+and+How&qid=1707072737&sprefix=,aps,120&sr=8-1][A Modern Introduction to Probability and Statistics: Understanding Why and How (Springer Texts in Statistics)]].

*Note:* The chapter numbers follow the relevant chapter numbers in the textbook for easy reference.
* Notes
** Chapter 2: Outcomes, Events and Probability
 This chapter is very important. It introduces the Axioms probability and various concepts such as events, sample spaces etc.
 + [[./ips/02. Outcomes, events, probability.pdf][Outcomes, Events and Probability]]

** Chapter 3: Conditional Probability and Independence
This chapter introduces conditional probability, multiplication rule, Law of Total Probability, Bayes Theorem and Independence.
+ [[./ips/03_ Conditional Probability and Indepenance.pdf][Conditional Probability and Indepenance]]

** Chapter 4: Discrete Random Variables
+ [[./ips/04_ Discrete Random Variables.pdf][Discrete Random Variables]]

** Chapter 5: Continuous Random Variables
+ [[./ips/5. Continuous Random Variables.pdf][Continuous Random Variables]]

** Chapter 7: Expectation and Variance
+ [[./ips/07_ Expectation abd Variance.pdf][Expectaion and Variance]]

** Chapter 8: Computations with Random Variables
+ [[./ips/08_ Computations with random variables.pdf][Computations with Random Variables]]

** Chapter 9: Joint Probability Distributions
+ [[./ips/09_ Joint Probability Distributions.pdf][Joint Probability Distributions]]

** Chapter 10: Covariance and Correlation
+ [[./ips/10_ Covariance and Correlation.pdf][Covariance and Correlation]]

** Chapter 13: Law of Large Numbers
+ [[./ips/13_ Law of large numbers.pdf][Law of Large Numbers]]

** Chapter 14: Central Limit Theorem
+ [[./ips/14_ Central Limit Theorem.pdf][Central Limit Theorem]]

** Chapter 17: Statistical Models
+ [[./ips/17_ Statistical Models.pdf][Statistical Models]]

** Chapter 19: Unbiased Estimators
+ [[./ips/19_ Unbiased Estimators.pdf][Unbiased Estimators]]

** Chapter 21: Maximum Likelihood
+ [[./ips/21_ Maximum Likelihood.pdf][Maximum Likelihood]]

** Chapter 22: Simple Linear Regression
+ [[./ips/22_ Simple Linear Regression .pdf][Simple Linear Regression]]

** Chapter 23: Confidence Intervals for the Mean
+ [[./ips/23_ Confidence intervals for the mean.pdf][Confidence Interavals for the Mean]]

* TODO
- Add some minor additions to Confidence Intervals for the Mean
