ips.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-04 Sun 23:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction to Probability and Statistics</title>
<meta name="author" content="Akash Gopinath" />
<meta name="description" content="Probability and Statistics Notes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Introduction to Probability and Statistics</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0816cbb">Pre Requisites</a></li>
<li><a href="#orge792f53">Reference Textbook</a></li>
<li><a href="#org128b206">Notes</a>
<ul>
<li><a href="#org1e8db97">Chapter 2: Outcomes, Events and Probability</a></li>
<li><a href="#org8c33d30">Chapter 3: Conditional Probability and Independence</a></li>
<li><a href="#org1cf85b9">Chapter 4: Discrete Random Variables</a></li>
<li><a href="#org0e83012">Chapter 5: Continuous Random Variables</a></li>
<li><a href="#org120c6e0">Chapter 7: Expectation and Variance</a></li>
<li><a href="#org9a959a0">Chapter 8: Computations with Random Variables</a></li>
<li><a href="#org34683a7">Chapter 9: Joint Probability Distributions</a></li>
<li><a href="#orgc5576f2">Chapter 10: Covariance and Correlation</a></li>
<li><a href="#orgecd372d">Chapter 13: Law of Large Numbers</a></li>
<li><a href="#org49383f9">Chapter 14: Central Limit Theorem</a></li>
<li><a href="#org43967ba">Chapter 17: Statistical Models</a></li>
<li><a href="#org8df7465">Chapter 19: Unbiased Estimators</a></li>
<li><a href="#orgd7057b6">Chapter 21: Maximum Likelihood</a></li>
<li><a href="#org43550cf">Chapter 22: Simple Linear Regression</a></li>
<li><a href="#org8f749b7">Chapter 23: Confidence Intervals for the Mean</a></li>
</ul>
</li>
<li><a href="#org754008b"><span class="todo TODO">TODO</span> </a></li>
</ul>
</div>
</div>
<div id="outline-container-org0816cbb" class="outline-2">
<h2 id="org0816cbb">Pre Requisites</h2>
<div class="outline-text-2" id="text-org0816cbb">
<p>
The only requirement is a course on Calculus, Set Theory and Logic.
</p>
</div>
</div>
<div id="outline-container-orge792f53" class="outline-2">
<h2 id="orge792f53">Reference Textbook</h2>
<div class="outline-text-2" id="text-orge792f53">
<p>
The textbook referenced in this course was <a href="https://www.amazon.co.uk/Modern-Introduction-Probability-Statistics-Understanding/dp/1852338962/ref=sr_1_1?crid=3CCIB6UU05SM7&amp;keywords=A+Modern+Introduction+to+Probability+and+Statistics+Understanding+Why+and+How&amp;qid=1707072737&amp;sprefix=,aps,120&amp;sr=8-1">A Modern Introduction to Probability and Statistics: Understanding Why and How (Springer Texts in Statistics)</a>.
</p>

<p>
<b>Note:</b> The chapter numbers follow the relevant chapter numbers in the textbook for easy reference.
</p>
</div>
</div>
<div id="outline-container-org128b206" class="outline-2">
<h2 id="org128b206">Notes</h2>
<div class="outline-text-2" id="text-org128b206">
</div>
<div id="outline-container-org1e8db97" class="outline-3">
<h3 id="org1e8db97">Chapter 2: Outcomes, Events and Probability</h3>
<div class="outline-text-3" id="text-org1e8db97">
<p>
This chapter is very important. It introduces the Axioms probability and various concepts such as events, sample spaces etc.
</p>
<ul class="org-ul">
<li><a href="./ips/02. Outcomes, events, probability.pdf">Outcomes, Events and Probability</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8c33d30" class="outline-3">
<h3 id="org8c33d30">Chapter 3: Conditional Probability and Independence</h3>
<div class="outline-text-3" id="text-org8c33d30">
<p>
This chapter introduces conditional probability, multiplication rule, Law of Total Probability, Bayes Theorem and Independence.
</p>
<ul class="org-ul">
<li><a href="./ips/03_ Conditional Probability and Indepenance.pdf">Conditional Probability and Indepenance</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1cf85b9" class="outline-3">
<h3 id="org1cf85b9">Chapter 4: Discrete Random Variables</h3>
<div class="outline-text-3" id="text-org1cf85b9">
<ul class="org-ul">
<li><a href="./ips/04_ Discrete Random Variables.pdf">Discrete Random Variables</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0e83012" class="outline-3">
<h3 id="org0e83012">Chapter 5: Continuous Random Variables</h3>
<div class="outline-text-3" id="text-org0e83012">
<ul class="org-ul">
<li><a href="./ips/5. Continuous Random Variables.pdf">Continuous Random Variables</a></li>
</ul>
</div>
</div>
<div id="outline-container-org120c6e0" class="outline-3">
<h3 id="org120c6e0">Chapter 7: Expectation and Variance</h3>
<div class="outline-text-3" id="text-org120c6e0">
<ul class="org-ul">
<li><a href="./ips/07_ Expectation abd Variance.pdf">Expectaion and Variance</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9a959a0" class="outline-3">
<h3 id="org9a959a0">Chapter 8: Computations with Random Variables</h3>
<div class="outline-text-3" id="text-org9a959a0">
<ul class="org-ul">
<li><a href="./ips/08_ Computations with random variables.pdf">Computations with Random Variables</a></li>
</ul>
</div>
</div>
<div id="outline-container-org34683a7" class="outline-3">
<h3 id="org34683a7">Chapter 9: Joint Probability Distributions</h3>
<div class="outline-text-3" id="text-org34683a7">
<ul class="org-ul">
<li><a href="./ips/09_ Joint Probability Distributions.pdf">Joint Probability Distributions</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc5576f2" class="outline-3">
<h3 id="orgc5576f2">Chapter 10: Covariance and Correlation</h3>
<div class="outline-text-3" id="text-orgc5576f2">
<ul class="org-ul">
<li><a href="./ips/10_ Covariance and Correlation.pdf">Covariance and Correlation</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgecd372d" class="outline-3">
<h3 id="orgecd372d">Chapter 13: Law of Large Numbers</h3>
<div class="outline-text-3" id="text-orgecd372d">
<ul class="org-ul">
<li><a href="./ips/13_ Law of large numbers.pdf">Law of Large Numbers</a></li>
</ul>
</div>
</div>
<div id="outline-container-org49383f9" class="outline-3">
<h3 id="org49383f9">Chapter 14: Central Limit Theorem</h3>
<div class="outline-text-3" id="text-org49383f9">
<ul class="org-ul">
<li><a href="./ips/14_ Central Limit Theorem.pdf">Central Limit Theorem</a></li>
</ul>
</div>
</div>
<div id="outline-container-org43967ba" class="outline-3">
<h3 id="org43967ba">Chapter 17: Statistical Models</h3>
<div class="outline-text-3" id="text-org43967ba">
<ul class="org-ul">
<li><a href="./ips/17_ Statistical Models.pdf">Statistical Models</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8df7465" class="outline-3">
<h3 id="org8df7465">Chapter 19: Unbiased Estimators</h3>
<div class="outline-text-3" id="text-org8df7465">
<ul class="org-ul">
<li><a href="./ips/19_ Unbiased Estimators.pdf">Unbiased Estimators</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd7057b6" class="outline-3">
<h3 id="orgd7057b6">Chapter 21: Maximum Likelihood</h3>
<div class="outline-text-3" id="text-orgd7057b6">
<ul class="org-ul">
<li><a href="./ips/21_ Maximum Likelihood.pdf">Maximum Likelihood</a></li>
</ul>
</div>
</div>
<div id="outline-container-org43550cf" class="outline-3">
<h3 id="org43550cf">Chapter 22: Simple Linear Regression</h3>
<div class="outline-text-3" id="text-org43550cf">
<ul class="org-ul">
<li><a href="./ips/22_ Simple Linear Regression .pdf">Simple Linear Regression</a></li>
</ul>
</div>
</div>
<div id="outline-container-org8f749b7" class="outline-3">
<h3 id="org8f749b7">Chapter 23: Confidence Intervals for the Mean</h3>
<div class="outline-text-3" id="text-org8f749b7">
<ul class="org-ul">
<li><a href="./ips/23_ Confidence intervals for the mean.pdf">Confidence Interavals for the Mean</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org754008b" class="outline-2">
<h2 id="org754008b"><span class="todo TODO">TODO</span> </h2>
<div class="outline-text-2" id="text-org754008b">
<ul class="org-ul">
<li>Add some minor additions to Confidence Intervals for the Mean</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Akash Gopinath</p>
<p class="date">Created: 2024-02-04 Sun 23:29</p>
</div>
</body>
</html>
